[
  {
    "title": "Bioinformatics Specialist",
    "organization": "Howard Hughes Medical Institute",
    "startDate": "2024-01",
    "endDate": "Present",
    "description": "Developing novel approaches for jointly modeling deep mutational scanning datasets using JAX. Building Nextflow pipelines for studying affinity maturation in germinal centers, managing sensitive data on HPC and AWS, and producing publication-quality figures."
  },
  {
    "title": "Bioinformatics Analyst II",
    "organization": "Fred Hutchinson Cancer Center",
    "startDate": "2021-01",
    "endDate": "2024-01",
    "description": "Designed algorithms for mutational fitness estimation across 13M+ viral genomes. Built and deployed public Nextstrain pages for genomic surveillance of SARS-CoV-2, Influenza, and Lassa virus. Mentored interns, students, and postdocs in computational methods."
  },
  {
    "title": "Research Associate",
    "organization": "Fred Hutchinson Cancer Center",
    "startDate": "2020-03",
    "endDate": "2020-12",
    "description": "Developed the phippery software suite for PhIP-Seq data analysis, including a Nextflow pipeline, Python API, and Streamlit visualization app. Contributed to global epistasis modeling with PyTorch. Led cross-lab team meetings."
  },
  {
    "title": "Graduate Teaching Fellow",
    "organization": "University of Oregon",
    "startDate": "2019-08",
    "endDate": "2020-03",
    "description": "Taught graduate-level Python/Bash scripting and algorithmic thinking. Built Docker containers and a Jupyter Notebook auto-grading pipeline. Led discussions and graded ~100 assignments per week."
  },
  {
    "title": "Scientific Programmer",
    "organization": "University of Oregon",
    "startDate": "2018-06",
    "endDate": "2019-06",
    "description": "Applied software engineering best practices to open-source tools including tskit, stdpopsim, and ReLERNN. Evaluated deep learning models for recombination rate estimation. Built Snakemake pipelines for population genetics analyses."
  },
  {
    "title": "Undergraduate Research Assistant",
    "organization": "University of Oregon",
    "startDate": "2017-06",
    "endDate": "2018-06",
    "description": "Implemented tree sequence recording in the SLiM population genetics simulator. Benchmarked large-scale simulations for an undergraduate honors thesis. Developed and analyzed evolutionary models of stickleback fish migration."
  }
]
